snlkuharlocal/src/Documents/СчетФактура/СчетФактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактура</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.Чек</basedOn>
  <basedOn>Document.ПродажаИМ</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСовсемБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСпособаВыставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Чек</types>
        <types>DocumentRef.ПродажаИМ</types>
        <types>String</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСовсемБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧека</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЦенВНакладной</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ОплатаПлатежнойКартой</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректируемыйСчетФактура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежноРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчетаФактурыПродавца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСДоКорректировки</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураНаАванс</name>
      <type>
        <types>DocumentRef.СчетФактураНаАванс</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектовУПД/ЗначенияСвойствОбъектовУПД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектовУПД</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/СчетФактура/ObjectModule.bsl
Функция ПолучитьКонтрагентаСклада(Склад)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект",Склад);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Контрагент получатель"));
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;
	КонецЦикла; 
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции //ПолучитьКонтрагентаСклада(Склад)

Процедура РасчетСтроки(СтрокаТЧ) Экспорт
	СтрокаТЧ.СуммаБезНДС18		=0;
	СтрокаТЧ.НДС18				=0;
	СтрокаТЧ.СуммаБезНДС10		=0;
	СтрокаТЧ.НДС10				=0;
	СтрокаТЧ.СуммаСовсемБезНДС	=0;
    
	Если СтрокаТЧ.Накладная<>Неопределено И НЕ СтрокаТЧ.Накладная.Пустая() Тогда
		ТабСтавок=СтрокаТЧ.Накладная.Товары.Выгрузить();
		ТабСтавок.Свернуть("СтавкаНДС","Всего,НДС");	
		
		СтрокаТЧ.Всего=ТабСтавок.Итог("Всего");		
		
		Для Каждого СтрокаСтавок Из ТабСтавок Цикл
			//крохин начало 08.01.2019
			//Если СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС18 Тогда
			Если СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС18 ИЛИ СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС20 Тогда
				//крохин конец 08.01.2019
				СтрокаТЧ.СуммаБезНДС18	= СтрокаСтавок.Всего-СтрокаСтавок.НДС;								
				СтрокаТЧ.НДС18			= СтрокаСтавок.НДС;			
			ИначеЕсли СтрокаСтавок.СтавкаНДС=Перечисления.СтавкиНДС.НДС10 Тогда
				СтрокаТЧ.СуммаБезНДС10	= СтрокаСтавок.Всего-СтрокаСтавок.НДС;								
				СтрокаТЧ.НДС10			= СтрокаСтавок.НДС;			
				//крохин начало 15.02.2019	
		//ИначеЕсли СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.БезНДС Тогда
		//для иностранцев
		ИначеЕсли СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.БезНДС ИЛИ СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.НДС0 Тогда
		//крохин конец 15.02.2019
				СтрокаТЧ.СуммаСовсемБезНДС	= СтрокаСтавок.Всего;			
			КонецЕсли;			
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Функция КонтрольДублейСФ(СФОбъект,Отказ,Дубли=Неопределено) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК СФ,
	|	Накладная
	|ИЗ
	|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	|ГДЕ
	|	Накладная В(&Накладные)
	|	И НЕ Ссылка.ПометкаУдаления
	|	И Ссылка <> &Ссылка
	|	И Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Накладные",СФОбъект.Накладные.ВыгрузитьКолонку("Накладная"));
	Запрос.УстановитьПараметр("Ссылка",СФОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация",СФОбъект.Организация);
	
	ЕстьДубли=Ложь;	
	
	Дубли=Новый Массив;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("На накладную: "+Выборка.Накладная+", по организации: """+СФОбъект.Организация+"""
		|	уже выписана СФ: "+Выборка.СФ,СтатусСообщения.Важное);		
		ЕстьДубли=Истина;	
		
		Дубли.Добавить(Выборка.СФ);
	КонецЦикла;
	
	Если НЕ Отказ И ЕстьДубли Тогда
		Отказ=Истина;
	КонецЕсли;	
	
	Возврат НЕ ЕстьДубли;
КонецФункции //КонтрольДублейСФ(СФОбъект,Отказ)

Функция УстановитьПометкуЧека(ЧекСсылка,Пометка)
	ЧекОбъект=ЧекСсылка.ПолучитьОбъект();
	ЧекОбъект.СДокументами=Пометка;
	
	Попытка	
		ЧекОбъект.Заблокировать();			
	Исключение		
		СообщитьОбОшибке("Не удалось заблокировать чек ! Возможно открыта форма чека !");
		ЧекОбъект=Неопределено;		
		Возврат Ложь;
	КонецПопытки;	
	
	ЧекОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Истина;
КонецФункции

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Шворобей ВЮ 12.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1395
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзНакладные", Накладные.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзНакладные.Накладная КАК Накладная
	|ПОМЕСТИТЬ тзНакладные
	|ИЗ
	|	&тзНакладные КАК тзНакладные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзНакладные.Накладная КАК Документ.РасходнаяНакладная) КАК Накладная
	|ИЗ
	|	тзНакладные КАК тзНакладные
	|ГДЕ
	|	ВЫРАЗИТЬ(тзНакладные.Накладная КАК Документ.РасходнаяНакладная).КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Комиссия)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	// Шворобей ВЮ 12.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1395
	
	ЕстьИзменения	= Модифицированность();
	НужноВыгружать = НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Отказ=НЕ ПолучитьПолномочиеПользователя("ВыпискаСФвОфисе");
			
			// Кухарь А.Ю. 08.04.2022 начало
			// Чтобы не создавали СФ по накладным с реальных складов других подразделений
			если не Отказ и ЭтоНовый() тогда
				если ЗначениеЗаполнено(Склад.КодФизическогоУзла) и Склад.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код тогда
					Отказ=Истина;
				КонецЕсли;
			КонецЕсли;
			// Кухарь А.Ю. 08.04.2022 конец
			
			Если Отказ Тогда
				Сообщить("Недостаточно полномочий для оформления СФ в офисной базе !",СтатусСообщения.Важное);			
			КонецЕсли;		
		КонецЕсли;
		
		//крохин начало 16.02.2012
		//запретим редактировать филиальные СФ в офисе и офисные - в филиале
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал ИЛИ Склад.ТипСклада = Перечисления.ТипСклада.ОптовыйТЦ Тогда
				#Если КЛИЕНТ Тогда
					сообщить("СФ по складу "+Склад + " редактируются только в соответствующем подразделении");
				#КОНЕЦЕСЛИ	
				Отказ = Истина;	
				
			КонецЕсли;
		ИначеЕсли ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			//крохин начало 11.04.2013
			//СФ можно редактировать только свои
			//Если Склад.ТипСклада <> Перечисления.ТипСклада.Филиал И Склад.ТипСклада <> Перечисления.ТипСклада.ОптовыйТЦ Тогда
			Если Склад.Подразделение <> ПараметрыСеанса.ЭтотУзел.Подразделение Тогда
				//крохин конец 11.04.2013
				#Если КЛИЕНТ Тогда
					сообщить("СФ по складу "+Склад + " редактируются только в офисе");
				#КОНЕЦЕСЛИ	
				Отказ = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		КонтрольДублейСФ(ЭтотОбъект,Отказ);		
		
		Если Отказ Тогда Возврат КонецЕсли;
		
	КонецЕсли;
	
	// Нечаева, 04,02,26 ,  проблемы, с отправкой писем для ПРО, массовые, не можем отследить. посмотрим по логам.
	// 55140 Отправка Уведомлений об удалении СФ  ELP-8721
	Если ЭтотОбъект.ПометкаУдаления = истина   ТОгда    
		попытка
			ЗаписатьВЛог("ОтправкаПисемПРО","1. "+ЭтотОбъект.Ссылка+" помечен на удаление "+ПланыОбмена.Основной.ЭтотУзел()+ПараметрыСеанса.Пользователь,,,,);
		исключение
		КонецПопытки;
	КонецЕсли;	

	
	Если ЕстьИзменения Тогда		
		СуммаБезНДС18		=Накладные.Итог("СуммаБезНДС18");
		НДС18				=Накладные.Итог("НДС18");
		СуммаБезНДС10		=Накладные.Итог("СуммаБезНДС10");
		НДС10				=Накладные.Итог("НДС10");
		СуммаСовсемБезНДС	=Накладные.Итог("СуммаСовсемБезНДС");
		Всего				=СуммаБезНДС18+НДС18+СуммаБезНДС10+НДС10+СуммаСовсемБезНДС;
		
		Для Каждого СтрокаТЧ Из Накладные Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Накладная.Номер) Тогда
				Если СтрокаТЧ.Накладная.Метаданные().Имя="Перемещение" Тогда
					Контрагент=ПолучитьКонтрагентаСклада(СтрокаТЧ.Накладная.СкладПолучатель);						
				Иначе
					Контрагент=СтрокаТЧ.Накладная.Контрагент;
				КонецЕсли;		
				
				Прервать;			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
	
	//нечаева 29,05,23++
	
	//нечаева 27,06,24++
		
	// Нечаева, 04,02,26 ,  проблемы, с отправкой писем для ПРО, массовые, не можем отследить. посмотрим по логам.
	// 55140 Отправка Уведомлений об удалении СФ  ELP-8721
	//Если ЭтотОбъект.ПометкаУдаления = истина   ТОгда    
	//	попытка
	//		ЗаписатьВЛог("ОтправкаПисемПРО","2. "+ЭтотОбъект.Ссылка+" помечен на удаление "+ПланыОбмена.Основной.ЭтотУзел()+ПараметрыСеанса.Пользователь,,,,);
	//	исключение
	//	КонецПопытки;
	//КонецЕсли;	
	
	
	// Нечаева 02,03,26 +++ пока уберу проверку, не все письма приходят, возможно какой-то глюк 1с.
	// Отправка Уведомлений об удалении СФ  ELP-8721

	
	//СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	//ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом
	
	Если  (ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL")) 
		Тогда        
		//нечаева 27,06,24--
		
		Если ЭтотОбъект.ПометкаУдаления = истина   ТОгда
			
			КрОши= новый Массив;
			
			РНК = ЭтотОбъект.Накладные[0].накладная.ссылка;
			Проверка = ПроверкаОтправленныхСФкРНК(РНК,ЭтотОбъект.Ссылка);
		  // Нечаева 02,03,26 +++
		  //55140 Отправка Уведомлений об удалении СФ  ELP-8721

			ЗаписатьВЛог("ОтправкаПисемПРО","2. "+ЭтотОбъект.Ссылка+" помечен на удаление, есть отправленный УПД"+ПланыОбмена.Основной.ЭтотУзел()+ПараметрыСеанса.Пользователь+ проверка,,,,);

			Если Проверка ТОгда
				КрОши.Добавить("Помечена на удаление СФ, по которой уже есть отправленный УПД.  "+ЭтотОбъект+ " - "+РНК.Контрагент+ " - "+РНК);
				СообщитьКритическиеОшибки(КрОши,"Ошибка отправки УПД");   
				попытка
					ЗаписатьВЛог("ОтправкаПисемПРО","3. "+ЭтотОбъект.Ссылка+" помечен на удаление, есть отправленный УПД"+ПланыОбмена.Основной.ЭтотУзел()+ПараметрыСеанса.Пользователь,,,,);
				исключение
				КонецПопытки;
			конецЕсли;	
		КонецЕсли;		
	КонецЕсли;

	//нечаева 29,05,23--
	
	
КонецПроцедуры


//нечаева 29,05,23+++
Процедура СообщитьКритическиеОшибки(массивОшибок, ТемаПисьма) Экспорт
	
	Если массивОшибок.количество()=0 ТОгда
		возврат;
	КонецЕсли;	
	
	
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;

	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	СообщениеКрит.Получатели.Добавить("pro@collant.ru");

	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема=""+ТемаПисьма+" Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если массивОшибок.Количество()>0 Тогда
		Для рр=0 по массивОшибок.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+массивОшибок[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	//попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	//исключение
	//	ЗаписатьВЛог("екод","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
	//	
	//конецПопытки;
	//
КонецПроцедуры

Функция ПроверкаОтправленныхСФкРНК(РНК,СФ)

	 Проверка = ложь;

	 	
		Запрос = Новый Запрос;
		запрос.Текст=	"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Документ,
		|	ЛОЖЬ КАК Пометка,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	 НЕ ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.Ссылка = (&Докумен)
		|	И СчетФактураНакладные.Накладная = (&РНК)";
			
	   
		Запрос.УстановитьПараметр("РНК",РНК);
		Запрос.УстановитьПараметр("Докумен",СФ);
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		 
	 рез = запрос.Выполнить().Выбрать();
	 
	 Если Рез.следующий() >0 ТОгда
		//сообщить("По документу " +РНК+ " уже есть отправленная СФ "+Рез.Документ );
		//КритичОшибки.добавить("По документу " +РНК+ " уже есть отправленная СФ "+Рез.Документ );
		 Проверка = истина;
	 КонецЕсли;
	 
	
	
	 возврат Проверка;
	
КонецФункции
// нечаева 29,05,23---



Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	Если НЕ ОбменДанными.Загрузка Тогда
		Для Каждого СтрокаНакладной Из Накладные Цикл
			Накладная=СтрокаНакладной.Накладная;
			Если Накладная<>Неопределено И НЕ Накладная.Пустая() И Накладная.Метаданные().Имя="Чек" И ЗначениеЗаполнено(Накладная.Номер) Тогда
				Отказ=Не УстановитьПометкуЧека(Накладная,Истина);				
			КонецЕсли; 				
		КонецЦикла; 				
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Для Каждого СтрокаНакладной Из Накладные Цикл
			Накладная=СтрокаНакладной.Накладная;
			Если Накладная<>Неопределено И НЕ Накладная.Пустая() И Накладная.Метаданные().Имя="Чек" Тогда
				Отказ=Не УстановитьПометкуЧека(Накладная,Ложь);
			КонецЕсли; 				
		КонецЦикла; 				
	КонецЕсли;
	//крохин начало
	Для Каждого СтрокаНакладной Из Накладные Цикл
		Накладная=СтрокаНакладной.Накладная;
		Если Накладная<>Неопределено И ЕстьРеквизитДокумента("СостояниеДокументов",Накладная.Метаданные()) Тогда
			НакладнаяОбъект = Накладная.ПолучитьОбъект();
			//крохин начало 15.04.2013
			//НакладнаяОбъект.СостояниеДокументов = Перечисления.СостояниеДокументов.НеВыписаны;
			//НакладнаяОбъект.Записать(РежимЗаписиДокумента.Запись);
			НакладнаяОбъект.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.НеВыписаны,Неопределено,Истина);
			//крохин конец 15.04.2013
		КонецЕсли ;
	КонецЦикла; 	
	//крохин конец	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	
	ВидОснования = Основание.Метаданные().Имя;
	
	ИБ			 = Основание.ИБ; 
	
	Если ВидОснования = "РасходнаяНакладная" Тогда				
		Контрагент   = Основание.Контрагент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=Накладные.Добавить();
			СтрокаТЧ.Накладная=Основание;			
		КонецЕсли;
	ИначеЕсли ВидОснования = "Чек" Тогда	

		Контрагент   = Основание.Контрагент;
			
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
	     //крохин начало
	     //проверка для чеков
		 Если Основание.ПометкаУдаления И НЕ РольДоступна("Администратор") Тогда
			 сообщить("СФ на основании помеченного на удаление чека ввести невозможно");
		 КонецЕсли;	 
	     //крохин конец

			СтрокаТЧ=Накладные.Добавить();
			СтрокаТЧ.Накладная=Основание;			
			СтрокаТЧ.НомерЧека=Основание.Номер;	
		КонецЕсли;
	ИначеЕсли ВидОснования="Перемещение" Тогда	
		Контрагент   = ПолучитьКонтрагентаСклада(Основание.СкладПолучатель);
			
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=Накладные.Добавить();
			СтрокаТЧ.Накладная=Основание;			
		КонецЕсли;
	ИначеЕсли ВидОснования = "ПродажаИМ" Тогда				
		Контрагент   = Основание.Контрагент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=Накладные.Добавить();
			СтрокаТЧ.Накладная=Основание;			
		КонецЕсли;
	
	КонецЕсли;	
	
	Если ВидОснования = "РасходнаяНакладная" И ЗначениеЗаполнено(Основание.ДатаОтгрузки) И НачалоДня(Основание.ДатаОтгрузки)>НачалоДня(Основание.Дата) Тогда
		Дата=Основание.ДатаОтгрузки;		
	Иначе
		СдвигДаты=ПолучитьЗначениеПоУмолчанию("СдвигатьДатуСФ");
		Если СдвигДаты<>Неопределено Тогда
			Дата=Основание.Дата+СдвигДаты*24*60*60;		
		КонецЕсли;
	КонецЕсли;	
	
	Для Каждого СтрокаТЧ Из Накладные Цикл
		РасчетСтроки(СтрокаТЧ);	
	КонецЦикла; 
КонецПроцедуры
